~Cases/HeatTransfer/cht_SS_TdepThermo_RAS/0.orig/fluid_0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 300;

    boundaryField
    {
        "proc.*"
        {
        type            processor;
        }
        "inlet"
        {
        type            fixedValue;
        value           uniform 300;
        }

		"outlet"
        {
		type            inletOutlet;
        inletValue      uniform 300;
        value           $internalField;
        }

        "fluid_0-solid"
        {
        type            compressible::turbulentTemperatureRadCoupledMixed;
        Tnbr            T;
        kappaMethod     fluidThermo;
        value           uniform 300;
        }
    }



// ************************************************************************* //
