~Cases/HeatTransfer/cht_SS_TdepThermo_RAS/0.orig/fluid_0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0.5 0 0);

    boundaryField
    {
        "inlet"
        {
            type            fixedValue;
            value           $internalField;
        }
		
		"outlet"
        {
            type            zeroGradient;
        }

		"fluid_0-solid"
		{
            type            noSlip;
		}

        "proc.*"
        {
            type            processor;
        }

    }


// ************************************************************************* //
