~Cases/HeatTransfer/cht_SS_TdepThermo_RAS/0.orig/fluid_0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

    boundaryField
    {
        "inlet"
        {
            type            calculated;
		    value		$internalField;
        }	
		
		"outlet"
		{
            type            calculated;
            value           uniform 0;
		}
		
		"fluid_0-solid"
		{
            type            compressible::alphatWallFunction;
		    value			$internalField;
		}

        "proc.*"
        {
            type            processor;
        }
    }



// ************************************************************************* //
