~Cases/HeatTransfer/cht_SS_TdepThermo_RAS/0.orig/fluid_0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

    boundaryField
    {
		"inlet"
		{
			type            fixedFluxPressure;
		}	
		
		"outlet"
		{
        	type            fixedValue;
        	value           $internalField;;
		}		
		
		"fluid_0-solid"
		{
			type            fixedFluxPressure;
		}

        "proc.*"
        {
        	type            processor;
        }			
    }

// ************************************************************************* //
